eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеОбъектовИнформационнойБазы/абс_СоответствиеОбъектовИнформационнойБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СоответствиеОбъектовИнформационнойБазы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Приемник</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </resources>
  <dimensions>
    <name>ДЗО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеОбъектовИнформационнойБазы/ManagerModule.bsl
Функция ПолучитьОбъектПриемник(Источник, ДЗО, Филиал) Экспорт
	Структура = Получить(Новый Структура("Источник, ДЗО, Филиал", Источник, ДЗО, Филиал));
	Возврат Структура.Приемник;	
КонецФункции
   
Функция ПолучитьТаблицуСоответствия(ДЗО, Филиал, Тип) Экспорт
	
   	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	абс_СоответствиеОбъектовИнформационнойБазы.ДЗО,
		|	абс_СоответствиеОбъектовИнформационнойБазы.Филиал,
		|	абс_СоответствиеОбъектовИнформационнойБазы.Источник,
		|	абс_СоответствиеОбъектовИнформационнойБазы.Приемник
		|ИЗ
		|	РегистрСведений.абс_СоответствиеОбъектовИнформационнойБазы КАК абс_СоответствиеОбъектовИнформационнойБазы
		|ГДЕ
		|	(абс_СоответствиеОбъектовИнформационнойБазы.Источник ССЫЛКА ЗаменаТип
		|			ИЛИ абс_СоответствиеОбъектовИнформационнойБазы.Приемник ССЫЛКА ЗаменаТип)
		|	И абс_СоответствиеОбъектовИнформационнойБазы.ДЗО = &ДЗО
		|	И абс_СоответствиеОбъектовИнформационнойБазы.Филиал = &Филиал";
    Запрос.УстановитьПараметр("ДЗО", ДЗО);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаменаТип", Тип);
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
